# -*- coding:utf-8 -*-

from rpa import Chrome, IE, log, ChromeOptions, update_panel
from rpa.visual_block.visual_block import VisualBlock
import sys, os

__taskId = None
try:
    import getopt

    opts, _ = getopt.getopt(sys.argv[2:], '-h-t:', ['help', 'taskId='])
    for k, v in opts:
        if k in ('-t', '--taskId'):
            __taskId = v
except Exception as e:
    pass
try:
    import pywinauto
except:
    pass

visual_block = VisualBlock(taskId=__taskId)
visual_block.Visual_Block_Total_Block(7)

# -*- 参数面板
try:

    PANEL_VARS = {
    }

except Exception as e:
    log.error("[%s] %s", "参数面板", str(e))

# -*- 传入的JSON
try:

    update_panel(sys.argv, PANEL_VARS)

except Exception as e:
    log.error("[%s] %s", "传入的JSON", str(e))

# -*- 启动浏览器
try:
    visual_block.Visual_Block_Info("启动浏览器", 1, 0, "正在执行")

    option = ChromeOptions()
    prefs = {'safebrowsing.enabled': True}
    option.add_experimental_option('prefs', prefs)
    rpa_f5e47a_browser = Chrome(option)

except Exception as e:
    visual_block.Visual_Block_Info("启动浏览器", 1, 2, e)

    log.error("[%s] %s", "启动浏览器", str(e))
    raise e

# -*- 浏览器最大化
try:
    visual_block.Visual_Block_Info("浏览器最大化", 2, 0, "正在执行")

    rpa_f5e47a_browser.max_window()

except Exception as e:
    visual_block.Visual_Block_Info("浏览器最大化", 2, 2, e)

    log.error("[%s] %s", "浏览器最大化", str(e))
    raise e

# -*- 打开网页
try:
    visual_block.Visual_Block_Info("打开网页", 3, 0, "正在执行")

    rpa_eb862f_webpage = rpa_f5e47a_browser.create(
        "http://search.sina.com.cn/?q=%D5%D0%C9%CC%D2%F8%D0%D0&c=news&from=index&col=&range=&source=&country=&size=&time=&a=&page=2&pf=0&ps=0&dpc=1")

except Exception as e:
    visual_block.Visual_Block_Info("打开网页", 3, 2, e)

    log.error("[%s] %s", "打开网页", str(e))
    raise e

# -*- 创建excel_list
try:
    visual_block.Visual_Block_Info("创建excel_list", 4, 0, "正在执行")

    excel_list = ['华联股份', '湖北能源', '城发环境', '海南高速', '中鼎股份', '峨眉山Ａ', '中嘉博创', '法 尔 胜', '欢瑞世纪', '东凌国际', '双汇发展', '*ST津滨',
                  '鞍钢股份', '赣能股份', '现代投资', '航天科技', '新洋丰', '云内动力', '厦门港务', '浙商中拓', '景峰医药', '数源科技', '大亚圣象', '*ST 南糖',
                  '泸天化', '钱江摩托', '山大华特', '电广传媒', '嘉凯城', '金陵药业', '南方汇通', '海信家电', '佳电股份', '河钢资源', '众合科技', '福星股份', '一汽夏利',
                  '中钢国际', '兰州黄河', '中粮科技', '中 关 村', '华菱钢铁', '神火股份', '四川双马', '华西股份', '冀中能源', '紫光股份', '南天信息', '新乡化纤',
                  '重药控股', '中国重汽', '广济药业', '*ST河化', '欣龙控股', '中通客车', '东方能源', '首钢股份', '锡业股份', '中南建设', '东方钽业', '华东医药',
                  '天保基建', '长源电力', '盈峰环境', '蓝焰控股', '安泰科技', '中科三环', '*ST高升', 'ST中基', '佛塑科技', '银泰黄金', '华铁股份', '浪潮信息',
                  '桂林旅游', '众泰汽车', 'ST银亿', '*ST 中绒', '西山煤电', '大庆华科', '越秀金控', '华工科技', '九 芝 堂', '诚志股份', '闽东电力', '中国中期',
                  '新 大 陆', '隆平高科', '华润三九', '宗申动力', '招商港口', '豫能控股', '招商积余', '招商公路', '招商蛇口', '新 和 成', '鸿达兴业', '伟星股份',
                  '华邦健康', '*ST德豪', '精功科技', '华兰生物', '大族激光', '天奇股份', '传化智联', '盾安环境', '凯恩股份', '中航机电', '永新股份', '协鑫能科',
                  '世荣兆业', '东信和平', '亿帆医药', '京新药业', '*ST中捷', '科华生物', '海特高新', '苏宁易购', '航天电器', '山东威达', '分众传媒', '思源电气',
                  '七 匹 狼', '达安基因', '巨轮智能', '苏 泊 尔', '丽江旅游', '旺能环境', '华帝股份', '联创电子', '保利联合', '双鹭药业', '黔源电力', '南 京 港',
                  '登海种业', '华孚时尚', '兔 宝 宝', '美年健康', '国光电器', '轴研科技', '宝鹰股份', '宁波华翔', '紫光国微', '三花智控', '中工国际', '同洲电子',
                  '云南能投', '德美化工', '得润电子', '横店东磁', '中钢天源', '威 尔 泰', '云南旅游', '粤 水 电', '浙江交科', '宏润建设', '远光软件', '华峰氨纶',
                  '东华软件', '瑞泰科技', '景兴纸业', '黑猫股份', '獐子岛', '长城影视', '*ST凯瑞', '软控股份', '国轩高科', '沙钢股份', '雪 莱 特', '大港股份',
                  '太阳纸业', '苏州固锝', '中材科技', '金 螳 螂', '万邦德', '孚日股份', '海鸥住工', '万丰奥威', 'ST东海洋', '新野纺织', '鲁阳节能', '*ST新海',
                  '金智科技', '江苏国泰', '中泰化学', '国脉科技', '青岛金王', '生 意 宝', '南岭民爆', '山河智能', '浔兴股份', '海翔药业', '天康生物', '广东鸿图',
                  'ST冠福', '广博股份', '恒宝股份', '信隆健康', '莱宝高科', '沃华医药', '沧州明珠', '兴化股份', '三钢闽光', '威海广泰', '三变科技', 'ST天润',
                  '罗平锌电', '三维通信', '中国海诚', '东港股份', '紫鑫药业', '康强电子', '韵达股份', '科陆电子', '*ST天马', '梦网集团', '天邦股份', '湘潭电化',
                  '银轮股份', '南极电商', '露天煤业', '中环股份', '沃尔核材', '利欧股份', '恒星科技', '广宇集团', '天津普林', '东南网架', '安 纳 达', '麦达数字',
                  '顺络电子', '拓邦股份', '东华科技', '贤丰控股', '宁波银行', '宏达高科', '中核钛白', '荣盛发展', 'ST新光', '北纬科技', '西部材料', '通润装备',
                  '北斗星通', '广电运通', '石基信息', '报 喜 鸟', '湖南黄金', '通富微电', '正邦科技', '汉钟精机', '三特索道', '常铝股份', '远 望 谷', '悦心健康',
                  '中航三鑫', '宁波东力', '红 宝 丽', '莱茵生物', '东方锆业', '惠程科技', '智光电气', '芭田股份', '楚江新材', '澳洋健康', '创新医疗', '游族网络',
                  '*ST东网', '江特电机', '御银股份', '延华智能', '中航光电', '纳思达', '粤 传 媒', '云海金属', '怡 亚 通', '海得控制', '华天科技', '全 聚 德',
                  '广百股份', '*ST巴士', '中光学', '*ST集成', '劲嘉股份', '融捷股份', '如意集团', '武汉凡谷', '二三四五', '方正电机', '证通电子', '嘉应制药',
                  '东晶电子', '*ST云投', '九鼎新材', '金风科技', '海亮股份', '大连重工', '国统股份', '海 利 得', 'ST准油', '合肥城建', '达 意 隆', '*ST飞马',
                  '宏达新材', '南洋股份', '特 尔 佳', '大立科技', '诺 普 信', '三全食品', '合力泰', '拓日新能', '恒康医疗', 'ST天宝', '东华能源', '福晶科技',
                  '鱼跃医疗', '三 力 士', '濮耐股份', '江南化工', '奥 特 迅', '合兴包装', '鸿博股份', '科大讯飞', '奥维通信', '启明信息', '塔牌集团', '民和股份',
                  '安妮股份', '大华股份', '恒邦股份', '天威视讯', '奥特佳', '威华股份', '歌尔股份', '九阳股份', '通产丽星', '滨江集团', '澳洋顺昌', '北化股份', '聚力文化',
                  '华东数控', '大洋电机', '联化科技', '步 步 高', '上海莱士', '川大智胜', '泰和新材', '海陆重工', '兆新股份', '利尔化学', '*ST升达', '拓维信息',
                  '恩华药业', '*ST东南', '新 华 都', '西仪股份', '浙富控股', '陕天然气', '卫 士 通', '美邦服饰', '华明装备', '东方雨虹', '川润股份', '水晶光电',
                  '华昌化工', '桂林三金', '万马股份', '友阿股份', '神开股份', '久其软件', '联络互动', '光迅科技', '博深股份', '天润曲轴', '亚太股份', '世联行', '保龄宝',
                  '奇正藏药', '超华科技', '*ST宇顺', '*ST中科', '星期六', '奥飞娱乐', '罗莱生活', '信立泰', '精艺股份', '辉煌科技', '博云新材', '中电兴发',
                  '圣农发展', '太阳电缆', '齐心集团', '西部建设', '美盈森', '洋河股份', '南国置业', 'ST云网', '北新路桥', '威创股份', '中利集团', '东方园林', '海大集团',
                  '三泰控股', '日海智能', '南山控股', '焦点科技', '亚联发展', '众生药业', '久立特材', '乐通股份', '海峡股份', '华英农业', '理工环科', 'ST百特', '普利特',
                  '洪涛股份', '永太科技', '富安娜', '新朋股份', '皇氏集团', '得利斯', '皖通科技', '仙琚制药', '*ST罗普', '英威腾', '科华恒盛', '*ST人乐', '赛象科技',
                  '奥普光电', '积成电子', '格林美', '新纶科技', '巨力索具', '慈文传媒', '海宁皮城', '潮宏基', '柘中股份', '泰尔股份', '高乐股份', '精华制药', '北京科锐',
                  '漫步者', '顺丰控股', '杰瑞股份', '天神娱乐', '兴民智通', '*ST赫美', '富临运业', '森源电气', '*ST北讯', '同德化工', '神剑股份', '汉王科技',
                  '隆基机械', '中恒电气', '永安药业', '台海核电', '康力电梯', '太极股份', '卓翼科技', '亚太药业', '北方华创', '伟星新材', '千方科技', '丽鹏股份',
                  '亚厦股份', '新北洋', '国创高新', '章源钨业', '宏创控股', '科远智慧', '双箭股份', '蓝帆医疗', '合众思壮', '东山精密', '大北农', '天原集团', '维信诺',
                  '新亚制程', '航天彩虹', '信邦制药', '长青股份', '北京利尔', '力生制药', '联发股份', '双象股份', '星网锐捷', '梦洁股份', '垒知集团', '海普瑞', '省广集团',
                  '中远海科', '和而泰', '爱仕达', '嘉欣丝绸', '四维图新', '远东传动', '多氟多', '齐翔腾达', '雅克科技', '广联达', '延安必康', '汉森制药', '雷科防务',
                  '高德红外', '海康威视', '爱施德', '深南股份', '康盛股份', '天虹股份', '*ST毅昌', '达实智能', '科伦药业', '中粮资本', '贵州百灵', '凯撒文化',
                  '胜利精密', '*ST尤夫', '云南锗业', '兆驰股份', '杭氧股份', '棕榈股份', '九安医疗', '太安堂', '万里扬', '长江健康', '兴森科技', '誉衡药业', '江苏神通',
                  '启明星辰', '闰土股份', '众业达', '龙星化工', '金洲管道', '巨星科技', 'ST中南', '盛路通信', '晨鑫科技', '中原内配', '国星光电', '*ST康得',
                  '摩恩电气', '长高集团', '华软科技', '松芝股份', '百川股份', '欧菲光', '青龙管业', '益生股份', '晶澳科技', '赣锋锂业', '珠江啤酒', '嘉事堂', '沪电股份',
                  '众应互联', '海格通信', '天齐锂业', '二六三', '申通快递', '三维工程', '金正大', '中超控股', '双环传动', '圣莱达', '榕基软件', '立讯精密', '宝莫股份',
                  '常宝股份', '富春环保', '新筑股份', '双塔食品', '广田集团', '润邦股份', '江海股份', '希努尔', '嘉麟杰', '大金重工', '金固股份', '浙江永强', '山东墨龙',
                  '通鼎互联', '恒基达鑫', '荣盛石化', '华斯股份', '佳隆股份', '辉丰股份', '雅化集团', '汉缆股份', '*ST科林', '山西证券', '*ST利源', '鼎龙文化',
                  '搜于特', '弘高创意', '大康农业', '协鑫集成', '涪陵榨菜', '老板电器', '天广中茂', '天汽模', '中顺洁柔', '达华智能', '蓝丰生化', '宝馨科技', '金字火腿',
                  '旷达科技', '恺英网络', '科士达', '银河电子', '日发精机', '齐峰新材', '浙江众成', '天桥起重', '光正集团', '山东矿机', '新时达', '英飞拓', '海源复材',
                  '金财互联', '天顺风能', '新界泵业', '金杯电工', '杭锅股份', '林州重机', '飞龙股份', '海联金汇', '司尔特', '云图控股', '亚太科技', '鸿路钢构', '中化岩土',
                  '万和电气', '杰赛科技', '东方铁塔', '新联电子', '春兴精工', '金新农', '凯美特气', '千红制药', '尚荣医疗', '宝鼎科技', '南方轴承', '惠博普', '三七互娱',
                  '辉隆股份', '洽洽食品', '巨人网络', '亚威股份', '通达股份', '徐家汇', '兄弟科技', '森马服饰', '天沃科技', '顺灏股份', '益盛药业', '唐人神', '百润股份',
                  '*ST步森', '贝因美', '德力股份', '索菲亚', '清新环境', '明牌珠宝', '群兴玩具', '通达动力', '雷柏科技', '闽发铝业', '中京电子', '圣阳股份', '未名医药',
                  '好想你', '海能达', '西陇科学', '双星新材', 'ST围海', '奥拓电子', '史丹利', '瑞康医药', '万安科技', '恒大高新', '八菱科技', '日上集团', '比亚迪',
                  '豪迈科技', '海南瑞泽', '金禾实业', '山东章鼓', '盛通股份', '领益智造', '龙蟒佰利', '世纪华通', '以岭药业', '姚记科技', '大连电瓷', '中公教育',
                  '江苏国信', '捷顺科技', '爱康科技', '东方精工', '朗姿股份', '北玻股份', '奥佳华', '哈尔斯', '长青集团', '露笑科技', '丹邦科技', '艾格拉斯', '瑞和股份',
                  '美吉姆', '融钰集团', '亚玛顿', '完美世界', '光启技术', '金达威', '宜昌交运', '成都路桥', '*ST仁智', '华西能源', '德尔未来', '道明光学', '申科股份',
                  '棒杰股份', '安洁科技', '金安国纪', '赞宇科技', '勤上股份', '雪人股份', '跨境通', '永高股份', '*ST荣联', '万润股份', '佛慈制药', '华宏科技',
                  '青青稞酒', '仁东控股', '卫星石化', '博彦科技', '加加食品', '利君股份', '扬子新材', '海思科', '万润科技', '共达电声', 'ST摩登', '中科金财', '雪迪龙',
                  '凯文教育', '茂硕电源', '克明面业', '京威股份', '普邦股份', '长鹰信质', '首航高科', '德联集团', '鞍重股份', '奥马电器', '康达新材', '国盛金控',
                  '龙泉股份', '东江环保', '西部证券', '兴业科技', '东诚药业', '顺威股份', '浙江美大', '珠江钢琴', '福建金森', '奋达科技', '龙洲股份', '宏大爆破',
                  '*ST猛狮', '华东重机', '亿利达', '乔治白', '金河生物', '远大智能', '美亚光电', '冀凯股份', 'ST远程', '双成药业', '顾地科技', '煌上煌', '百洋股份',
                  '红旗连锁', '博实股份', '美盛文化', '新疆浩源', '奥瑞金', '海欣食品', '浙江世宝', '新宝股份', '良信电器', '众信旅游', '光洋股份', '天赐材料',
                  '*ST欧浦', '思美传媒', '东易日盛', '牧原股份', '登云股份', 'ST金贵', '岭南股份', '友邦吊顶', '麦趣尔', '金一文化', '金轮股份', '金莱特', '海洋王',
                  '跃岭股份', '龙大肉食', '一心堂', '特一药业', '好利来', '电光科技', '萃华珠宝', '燕塘乳业', '雄韬股份', '利民股份', '王子新材', '国信证券', '葵花药业',
                  '中矿资源', '万达电影', '爱迪尔', '光华科技', '三圣股份', '富煌钢构', '木林森', '仙坛股份', '埃斯顿', '世龙实业', '国光股份', '龙津药业', '易尚展示',
                  '昇兴股份', '永东股份', '奥赛康', '永兴材料', '南兴股份', '华通医药', '天际股份', '凤形股份', '多喜爱', '金发拉比', '汇洁股份', '蓝黛传动', '*ST索菱',
                  '先锋电子', '国恩股份', '普路通', '科迪乳业', '真视通', '众兴菌业', '康弘药业', '快意电梯', '文科园林', '柏堡龙', '久远银海', '高科石化', '中坚科技',
                  '三夫户外', '奇信股份', '可立克', '凯龙股份', '万里石', '银宝山新', '华源控股', '鹭燕医药', '建艺集团', '瑞尔特', '坚朗五金', '通宇通讯', '东音股份',
                  '永和智控', '世嘉科技', '第一创业', '帝欧家居', '环球印务', '天顺股份', '微光股份', '洪汇新材', '吉宏股份', '丰元股份', '华锋股份', '江阴银行',
                  '恒久科技', '红墙股份', '山东赫达', '亚泰国际', '恩捷股份', '路畅科技', '崇达技术', '和科达', '黄山胶囊', '富森美', '东方中科', '桂发祥', '凯莱英',
                  '中装建设', '凯中精密', '和胜股份', '纳尔股份', '易明医药', '高争民爆', '贝肯能源', '星网宇达', '名雕股份', '裕同科技', '比音勒芬', '弘亚数控',
                  '同为股份', '新宏泽', '英维克', '道恩股份', '张家港行', '华统股份', '视源股份', '翔鹭钨业', '泰嘉股份', '同兴达', '英联股份', '盐津铺子', '高斯贝尔',
                  '威星智能', '科达利', '麦格米特', '道道全', '皮阿诺', '捷荣技术', '美芝股份', '三晖电气', '力盛赛车', '洁美科技', '星帅尔', '瀛通通讯', '实丰文化',
                  '今飞凯达', '盘龙药业', '钧达股份', '传艺科技', '周大生', '绿康生化', '金溢科技', '香山股份', '伟隆股份', '*ST天圣', '新天药业', '安奈儿', '三利谱',
                  '智能自控', '元隆雅图', '长缆科技', '卫光生物', '美格智能', '金龙羽', '中设股份', '凌霄泵业', '京泉华', '沃特股份', '绿茵生态', '惠威科技', '东方嘉盛',
                  '弘宇股份', '中宠股份', '科力尔', '华通热力', '川恒股份', '中大力德', '意华股份', '赛隆药业', '英派斯', '哈三联', '大博医疗', '铭普光磁', '宇环数控',
                  '金逸影视', '华阳集团', '华森制药', '德生科技', '集泰股份', '庄园牧场', '佛燃股份', '中新赛克', '奥士康', '中欣氟材', '深南电路', '金奥博', '蒙娜丽莎',
                  '名臣健康', '德赛西威', '联诚精密', '伊戈尔', '润都股份', '盈趣科技', '华西证券', '泰永长征', '华夏航空', '润建股份', '宏川智慧', '锋龙股份', '明德生物',
                  '新兴装备', '天奥电子', '郑州银行', '兴瑞科技', '鹏鼎控股', '长城证券', '昂利康', '新疆交建', '新农股份', '宇晶股份', '华林证券', '新乳业', '恒铭达',
                  '青岛银行', '华阳国际', '奥美医疗', '金时科技', '亚世光电', '日丰股份', '鸿合科技', '西麦食品', '科瑞技术', '青农商行', '小熊电器', '青鸟消防',
                  '瑞达期货', '五方光电', '豪尔赛', '祥鑫科技', '苏州银行', '广电计量', '新大正', '嘉美包装', '锐明技术', '和远气体', '科安达', '侨银环保', '博杰股份',
                  '中国广核', '特锐德', '神州泰岳', '乐普医疗', '南风股份', '探路者', '莱美药业', '汉威科技', '天海防务', '安科生物', '立思辰', '鼎汉技术', '华测检测',
                  '新宁物流', '亿纬锂能', '爱尔眼科', '北陆药业', '网宿科技', '中元股份', '硅宝科技', '银江股份', '大禹节水', '吉峰科技', '宝德股份', '机器人', '华星创业',
                  '红日药业', '华谊兄弟', '天龙光电', '阳普医疗', '宝通科技', '金龙机电', '同花顺', '钢研高纳', '中科电气', '超图软件', '新宙邦', '数知科技', '上海凯宝',
                  '九洲电气', '回天新材', '朗科科技', '星辉娱乐', '赛为智能', '华力创通', '台基股份', '天源迪科', '合康新能', '福瑞股份', '世纪鼎利', '三五互联', '中青宝',
                  '欧比特', '鼎龙股份', '万邦达', '三维丝', '万顺新材', '蓝色光标', '东方财富', '旗天科技', '中能电气', '天龙集团', '豫金刚石', '海兰信', '三川智慧',
                  '安诺其', '南都电源', '金利华电', '碧水源', '华谊嘉信', '三聚环保', '当升科技', '华平股份', '数字政通', 'GQY视讯', '国民技术', '思创医惠', '数码科技',
                  '易成新能', '恒信东方', '奥克股份', '劲胜智能', '海默科技', '银之杰', '康芝药业', '荃银高科', '长信科技', '文化长城', '盛运环保', '金通灵', '科新机电',
                  '金刚玻璃', '国联水产', '华伍股份', '易联众', '智云股份', '高新兴', '精准信息', '双林股份', '振芯科技', '乾照光电', '达刚控股', '龙源技术', '西部牧业',
                  '建新股份', '吉药控股', '新开源', '华仁药业', '向日葵', '万讯自控', '顺网科技', '中航电测', '长盈精密', '坚瑞沃能', '嘉寓股份', '东方日升', '瑞普生物',
                  '经纬辉开', '阳谷华泰', '智飞生物', '亚光科技', '汇川技术', '易世达', '锐奇股份', '银河磁体', '锦富技术', '泰胜风能', '新国都', '英唐智控', '青松股份',
                  '华策影视', '大富科技', '宝利国际', '信维通信', '先河环保', '晨光生物', '晓程科技', '中环装备', '和顺电气', '沃森生物', '盈康生命', '宋城演艺',
                  '中金环境', '汤臣倍健', '香雪制药', '天舟文化', '量子生物', '世纪瑞尔', '昌红科技', '科融环境', '科泰电源', '瑞凌股份', '安居宝', '神雾环保', '恒泰艾普',
                  '振东制药', '新研股份', '秀强股份', '华中数控', '雷曼光电', '先锋新材', '通源石油', '天瑞仪器', '东方国信', '迪威迅', '万达信息', '天晟新材', '汉得信息',
                  '东富龙', '中电环保', '智慧松德', '元力股份', '朗源股份', '派生科技', '中海达', '腾邦国际', '四方达', '华峰超纤', '佐力药业', '捷成股份', '东软载波',
                  '力源信息', '通裕重工', '永清环保', '美亚柏科', '神农科技', '维尔利', '潜能恒信', '科斯伍德', '佳士科技', '福安药业', '长荣股份', '长海股份', '铁汉生态',
                  '纳川股份', '翰宇药业', '高盟新材', '海伦哲', '聚龙股份', '聚光科技', '舒泰神', '天喻信息', '理邦仪器', '欣旺达', '青岛中程', '天泽信息', '森远股份',
                  '亿通科技', '易华录', '佳讯飞鸿', '日科化学', '电科院', '东方电热', '安利股份', '鸿利智汇', '金运激光', '银禧科技', '科大智能', '北京君正', '正海磁材',
                  '金力泰', '上海钢联', '光韵达', '富瑞特装', '拓尔思', '永利股份', '银信科技', '洲明科技', '金城医药', '开尔新材', '方直科技', '上海新阳', '美晨生态',
                  '冠昊生物', '东宝生物', '飞力达', '瑞丰光电', '佳云科技', '瑞丰高材', '迪安诊断', '天玑科技', '宝莱特', '融捷健康', '新开普', '依米康', '初灵信息',
                  '光线传媒', '金信诺', '卫宁健康', '仟源医药', '常山药业', '星星科技', '开山股份', '精锻科技', '新天科技', '新莱应材', '雅本化学', '巴安水务', '隆华科技',
                  '佳创视讯', '通光线缆', '兴源环境', '尔康制药', '佳沃股份', '联建光电', '中威电子', '华宇软件', '开能健康', '和佳股份', '阳光电源', '梅安森', '三丰智能',
                  '海联讯', '华昌达', '和晶科技', '紫天科技', '金明精机', '三盛教育', '温州宏丰', '苏交科', '国瓷材料', '安科瑞', '飞利信', '朗玛信息', '利德曼',
                  '荣科科技', '华录百纳', '吴通控股', '蓝英装备', '博雅生物', '三六五网', '利亚德', '蓝盾股份', '三诺生物', '富春股份', '汉鼎宇佑', '长方集团', '同有科技',
                  '聚飞光电', '云意电气', '裕兴股份', '远方信息', '慈星股份', '中际旭创', '吉艾科技', '宜通世纪', '任子行', '邦讯技术', '天山生物', '戴维医疗', '掌趣科技',
                  '晶盛机电', '珈伟新能', '博晖创新', '麦捷科技', '海达股份', '同大股份', '硕贝德', '华灿光电', '旋极信息', '德威新材', '凯利泰', '中颖电子', '宜安科技',
                  '海伦钢琴', '华虹计通', '苏大维格', '天壕环境', '兆日科技', '津膜科技', '迪森股份', '新文化', '银邦股份', '开元股份', '润和软件', '科恒股份', '麦克奥迪',
                  '天银机电', '联创股份', '太空智造', '红宇新材', '南大光电', '泰格医药', '长亮科技', '金卡智能', '华鹏飞', '永贵电器', '北信源', '东土科技', '东华测试',
                  '蒙草生态', '光一科技', '我武生物', '楚天科技', '全通教育', '炬华科技', '天翔环境', '博腾股份', '中文在线', '恒华科技', '创意信息', '东方网力',
                  '汇金股份', '绿盟科技', '安控科技', '汇中股份', '扬杰科技', '恒通科技', '鹏翎股份', '易事特', '赢时胜', '鼎捷软件', '东方通', '安硕信息', '溢多利',
                  '斯莱克', '光环新网', '三联虹普', '雪浪环境', '飞天诚信', '富邦股份', '国祯环保', '艾比森', '天华超净', '康跃科技', '腾信股份', '中来股份', '天孚通信',
                  '菲利华', '迪瑞医疗', '天和防务', '飞凯材料', '京天利', '劲拓股份', '花园生物', '宝色股份', '汉宇集团', '博济医药', '科隆股份', '九强生物', '凯发电气',
                  '三环集团', '道氏技术', '正业科技', '金盾股份', '迦南科技', '芒果超媒', '中光防雷', '伊之密', '苏试试验', '南华仪器', '昆仑万维', '浩丰科技', '五洋停车',
                  '力星股份', '博世科', '鲁亿通', '航新科技', '中建环能', '唐德影视', '红相股份', '四通新材', '强力新材', '诚益通', '暴风集团', '富临精工', '蓝思科技',
                  '金石亚药', '中泰股份', '广生堂', '清水源', '鹏辉能源', '美康生物', '运达科技', '鲍斯股份', '普丽盛', '金雷股份', '双杰电气', '康斯特', '乐凯新材',
                  '全信股份', '浩云科技', '汉邦高科', '先导智能', '创业慧康', '山河药辅', '三鑫医疗', '深信服', '康拓红外', '耐威科技', '赢合科技', '全志科技', '金科文化',
                  '惠伦晶体', '田中精机', '华铭智能', '迈克生物', '星徽精密', '高伟达', '赛摩电气', '迅游科技', '四方精创', '信息发展', '中密控股', '厚普股份', '新元科技',
                  '德尔股份', '景嘉微', '聚隆科技', '胜宏科技', '合纵科技', '杭州高新', '神思电子', '光力科技', '濮阳惠成', '万孚生物', '沃施股份', '蓝海华腾', '赛升药业',
                  '东杰智能', '蓝晓科技', '恒锋工具', '中飞股份', '华自科技', '通合科技', '山鼎设计', '润欣科技', '盛天网络', '美尚生态', '中科创达', '富祥股份',
                  '温氏股份', '高澜股份', '启迪设计', '海顺新材', '新易盛', '昊志机电', '天邑股份', '川金诺', '名家汇', '苏奥传感', '维宏股份', '新美星', '金冠股份',
                  '雪榕生物', '中亚股份', '恒实科技', '友讯达', '三德科技', '久之洋', '海波重科', '盛讯达', '新光药业', '科大国创', '爱司凯', '世名科技', '辰安科技',
                  '博思软件', '中潜股份', '中国应急', '幸福蓝海', '健帆生物', '达志科技', '优博讯', '今天国际', '冰川网络', '陇神戎发', '达威股份', '农尚环境', '广信材料',
                  '同益股份', '横河模具', '深冷股份', '先进数通', '新晨科技', '朗科智能', '联得装备', '雄帝科技', '川环科技', '博创科技', '优德精密', '和仁科技',
                  '古鳌科技', '万集科技', '集智股份', '三超新材', '路通视信', '丝路视觉', '理工光科', '贝达药业', '佳发教育', '中富通', '汇金科技', '乐心医疗', '神宇股份',
                  '筑博设计', '科信技术', '激智科技', '精测电子', '星源材质', '天能重工', '太辰光', '平治信息', '安车检测', '兴齐眼药', '中旗股份', '容大感光', '开润股份',
                  '会畅通讯', '数字认证', '贝斯特', '晨曦航空', '英飞特', '赛托生物', '海辰药业', '奥联电子', '美联新材', '天铁股份', '熙菱信息', '江龙船艇', '移为通信',
                  '万里马', '华凯创意', '新雷能', '朗进科技', '欧普康视', '利安隆', '吉大通信', '诚迈科技', '雄塑科技', '瑞特股份', '康泰生物', '飞荣达', '立昂技术',
                  '长川科技', '恒锋信息', '金太阳', '拓斯达', '思特奇', '汇纳科技', '晨化股份', '美力科技', '宣亚国际', '富瀚微', '欣天科技', '尚品宅配', '安靠智电',
                  '寒锐钴业', '金银河', '光库科技', '维业股份', '博士眼镜', '捷捷微电', '万兴科技', '三雄极光', '华瑞股份', '华测导航', '亿联网络', '新劲刚', '普利制药',
                  '久吾高科', '光莆股份', '开立医疗', '彩讯股份', '中达安', '同和药业', '扬帆新材', '广和通', '凯普生物', '德艺文创', '正丹股份', '透景生命', '万通智控',
                  '南京聚隆', '正元智慧', '侨源气体', '超频三', '星云股份', '杭州园林', '太龙照明', '金陵体育', '雷迪克', '正海生物', '世纪天鸿', '晶瑞股份', '民德电子',
                  '弘信电子', '延江股份', '中孚信息', '江苏雷利', '圣邦股份', '科锐国际', '科蓝软件', '鹏鹞环保', '飞鹿股份', '江丰电子', '必创科技', '杰恩设计',
                  '沪宁股份', '大烨智能', '富满电子', '国科微', '佩蒂股份', '宇信科技', '建科院', '华大基因', '英科医疗', '中科信息', '电连技术', '隆盛科技', '英搏尔',
                  '朗新科技', '海特生物', '中石科技', '艾德生物', '智动力', '赛意信息', '创业黑马', '澄天伟业', '双一科技', '联合光电', '中环环保', '盛弘股份', '蠡湖股份',
                  '兆丰股份', '爱乐达', '电工合金', '万马科技', '光威复材', '岱勒新材', '森霸传感', '天宇股份', '创源文化', '九典制药', '阿石创', '威唐工业', '聚灿光电',
                  '精研科技', '万隆光电', '广哈通信', '永福股份', '英可瑞', '凯伦股份', '国立科技', '华信新材', '长盛轴承', '安达维尔', '海川智能', '怡达股份', '新余国科',
                  '一品红', '捷佳伟创', '药石科技', '宏达电子', '润禾材料', '天常股份', '乐歌股份', '科创信息', '科创新源', '设研院', '西菱动力', '光弘科技', '百邦科技',
                  '科顺股份', '奥飞数据', '明阳电路', '御家汇', '华宝股份', '越博动力', '天地数码', '欣锐科技', '汉嘉设计', '锐科激光', '金力永磁', '顶固集创', '宁德时代',
                  '迈为股份', '隆利科技', '爱朋医疗', '华致酒行', '中山金马', '罗博特科', '七彩化学', '康龙化成', '迈瑞医疗', '立华股份', '上海瀚讯', '锦浪科技', '新诺威',
                  '每日互动', '震安科技', '迪普科技', '德方纳米', '新媒股份', '智莱科技', '运达股份', '拉卡拉', '三角防务', '帝尔激光', '中简科技', '新城市', '惠城环保',
                  '德恩精工', '因赛集团', '卓胜微', '三只松鼠', '值得买', '国林科技', '海能实业', '中信出版', '唐源电气', '宇瞳光学', '仙乐健康', '壹网壹创', '佳禾智能',
                  '米奥兰特', '贝斯美', '钢研纳克', '锦鸡股份', '左江科技', '力合科技', '泰和科技', '矩子科技', '指南针', '电声股份', '斯迪克', '天迈科技', '久量股份',
                  '华辰装备', '中科海讯', '铂科新材', '易天股份', '泰林生物', '玉禾田', '艾可蓝', '双飞股份', '耐普矿机', '聚杰微纤', '英杰电气', '*ST中葡', 'ST明科',
                  'ST天成', '*ST长投', '*ST新亿', 'ST坊展', 'ST安通', '*ST莲花', 'ST创兴', 'ST罗顿', 'ST昌九', '*ST山水', 'ST椰岛', 'ST成城',
                  'ST景谷', 'ST昌鱼', '*ST信通', 'ST华仪', 'ST南化', 'ST亚星', 'ST正源', '*ST金泰', '*ST金山', 'ST抚钢', 'ST安泰', '*ST仰帆',
                  'ST柳化', '*ST九有', '*ST信威', 'ST康美', '*ST菲达', 'ST狮头', 'ST慧球', '*ST中孚', 'ST沪科', '*ST鹏起', '*ST富控', '*ST游久',
                  '*ST中安', '*ST瑞德', '*ST航通', '*ST刚泰', 'ST岩石', '*ST天雁', '*ST工新', '*ST百花', 'ST云维', '*ST华源', 'ST爱旭',
                  'ST运盛', 'ST辅仁', 'ST天业', '*ST厦工', 'ST宏盛', 'ST中天', 'ST厦华', '*ST电能', '*ST秋林', 'ST华鼎', 'ST庞大', 'ST锐电',
                  'ST蓝科', 'ST亚邦', 'ST威龙', 'ST中新']

except Exception as e:
    visual_block.Visual_Block_Info("创建excel_list", 4, 2, e)

    log.error("[%s] %s", "创建excel_list", str(e))
    raise e

# -*- 创建href_str
try:
    visual_block.Visual_Block_Info("创建href_str", 5, 0, "正在执行")

    href_str = ''

except Exception as e:
    visual_block.Visual_Block_Info("创建href_str", 5, 2, e)

    log.error("[%s] %s", "创建href_str", str(e))
    raise e

# -*- 创建flag
try:
    visual_block.Visual_Block_Info("创建flag", 6, 0, "正在执行")

    flag = 0

except Exception as e:
    visual_block.Visual_Block_Info("创建flag", 6, 2, e)

    log.error("[%s] %s", "创建flag", str(e))
    raise e

# -*- 循环执行
try:
    visual_block.Visual_Block_Info("循环执行", 7, 0, "正在执行")

    for rpa_e33d1e_any in excel_list:

        # -*- 公司名cmy_str
        try:
            cmy_str = rpa_e33d1e_any

        except Exception as e:
            log.error("[%s] %s", "公司名cmy_str", str(e))
            raise e

        # -*- 填写输入框内容
        try:
            from time import sleep

            sleep(0)
            rpa_eb862f_webpage.add_element("rpa_e8db42", id="keyword", css="#keyword",
                                           xpath=["//input[@id='keyword']", "//input"], frame=[])
            rpa_eb862f_webpage.switch_to_frame_by_path([])
            rpa_eb862f_webpage.get_element("rpa_e8db42", timeout=30).input(cmy_str, simulate=True)
            sleep(0)

        except Exception as e:
            log.error("[%s] %s", "填写输入框内容", str(e))
            raise e

        # -*- 点击搜索
        try:
            from time import sleep

            sleep(0)
            rpa_eb862f_webpage.add_element("rpa_60a30e", id="", css=".l .ipt-03",
                                           xpath=["//input[@value='']", "//input[2]"], frame=[])
            rpa_eb862f_webpage.switch_to_frame_by_path([])
            from rpa import ElementClickMethod

            rpa_eb862f_webpage.get_element("rpa_60a30e", timeout=30).click(method=ElementClickMethod.JS_CLICK)
            sleep(0)

        except Exception as e:
            log.error("[%s] %s", "点击搜索", str(e))
            raise e

        # -*- 循环执行2
        try:

            for rpa_46c713_any in range(0, 5, 1):

                # -*- 异常处理1
                try:
                    try:

                        # -*- 获取资讯列表
                        try:
                            from time import sleep

                            sleep(0)
                            rpa_eb862f_webpage.add_element("rpa_f0bdbf", id="",
                                                           css="div[class='box-result clearfix'] h2", xpath=[],
                                                           frame=[])
                            rpa_eb862f_webpage.switch_to_frame_by_path([])
                            rpa_a8b288 = rpa_eb862f_webpage.get_elements(element_name="rpa_f0bdbf", timeout=30)
                            sleep(0)

                        except Exception as e:
                            log.error("[%s] %s", "获取资讯列表", str(e))
                            raise e

                        # -*- 循环资讯列表
                        try:

                            for rpa_73cc73 in rpa_a8b288:

                                # -*- 获取大标题内容
                                try:
                                    from time import sleep

                                    sleep(0)
                                    rpa_eb862f_webpage.switch_to_frame_by_path(rpa_73cc73.frame)
                                    rpa_66b827_string = rpa_73cc73.text()
                                    sleep(0)

                                except Exception as e:
                                    log.error("[%s] %s", "获取大标题内容", str(e))
                                    raise e

                                # -*- 获取href元素
                                try:
                                    from time import sleep

                                    sleep(0)
                                    rpa_73cc73.switch_to_frame()
                                    rpa_021032_webelement = rpa_73cc73.children(index=0)
                                    sleep(0)

                                except Exception as e:
                                    log.error("[%s] %s", "获取href元素", str(e))
                                    raise e

                                # -*- 获取href内容
                                try:
                                    from time import sleep

                                    sleep(0)
                                    rpa_eb862f_webpage.switch_to_frame_by_path(rpa_021032_webelement.frame)
                                    rpa_60cdb7_string = rpa_021032_webelement.get_attr("href")
                                    sleep(0)

                                except Exception as e:
                                    log.error("[%s] %s", "获取href内容", str(e))
                                    raise e

                                # -*- 赋值href_str
                                try:
                                    href_str = rpa_60cdb7_string

                                except Exception as e:
                                    log.error("[%s] %s", "赋值href_str", str(e))
                                    raise e

                                # -*- 得到信息列表
                                try:
                                    import datetime

                                    rpa_66b827_string = rpa_66b827_string.rsplit(" ", 3)
                                    title_str = rpa_66b827_string[0]
                                    source_str = rpa_66b827_string[1]
                                    p_date = rpa_66b827_string[2] + ' ' + rpa_66b827_string[3]
                                    p_date = datetime.datetime.strptime(p_date, '%Y-%m-%d %H:%M:%S')
                                    # p_date = p_date.date()
                                    # if (rpa_b167b0_date-p_date).days > 0:
                                    #     flag = 1
                                    #     break


                                except Exception as e:
                                    log.error("[%s] %s", "得到信息列表", str(e))
                                    raise e

                                # -*- content处理
                                try:
                                    import requests
                                    from bs4 import BeautifulSoup
                                    import re

                                    if href_str == '':
                                        print([title_str, cmy_str])
                                        continue
                                    res = requests.get(href_str)
                                    res.encoding = 'utf-8'
                                    soup = BeautifulSoup(res.text, 'html.parser')
                                    content_str = ''
                                    html_content = ''
                                    if source_str == '黑猫投诉':
                                        html_content = str(soup.select('.ts-d-question')[0]) + '\n\n' + str(
                                            soup.select('.ts-d-steplist')[0])
                                        article1 = soup.select('.ts-d-question .article')[0].text + \
                                                   soup.select('.ts-d-question .ts-q-user')[0].text + \
                                                   soup.select('.ts-d-question .ts-q-list')[0].text
                                        article2 = soup.select('.ts-d-steplist')[0].text
                                        article1 = re.sub('\n{2,}', '\n', article1)
                                        article2 = re.sub('\n{2,}', '', article2)
                                        article2 = re.sub('\s{2,}', '\n', article2)
                                        content_str = article1 + article2
                                    else:
                                        html_content = soup.select('.article')
                                        if html_content == []:
                                            content_str = soup.select('.article-body')
                                        html_content = str(content_str[0])
                                        content_str = re.sub('\n', '', content_str[0].text)
                                        content_str = re.sub('\s{2,}', '\n', content_str)
                                        if content_str.startswith('\n'):
                                            content_str = content_str[1::]
                                        if content_str.endswith('\n'):
                                            content_str = content_str[:len(content_str) - 1:]

                                except Exception as e:
                                    log.error("[%s] %s", "content处理", str(e))
                                    raise e

                                # -*- 写入redis
                                try:
                                    import time
                                    import json
                                    # tmp_dict = {"title":title_str,
                                    #             "content_html":html_content,
                                    #             "content":content_str,
                                    #             "publishdate":time.mktime(p_date.timetuple()),
                                    #             "source":source_str,
                                    #             "company":cmy_str,
                                    #             "summary":None,
                                    #             "tags":None}
                                    import csv

                                    # ‪C:\Users\Administrator\Desktop\test.csv
                                    with open(r'C:\\Users\\Administrator\\Desktop\\test.csv', 'a', newline='',
                                              encoding='utf-8') as csvfile:
                                        writer = csv.writer(csvfile)
                                        # 先写入columns_name
                                        writer.writerow(title_str, html_content, content_str, p_date, source_str,
                                                        cmy_str)
                                    # tmp_dict = dict(title=title_str,content_html=html_content,content=content_str,publishdate=time.mktime(p_date.timetuple()),source=source_str,company=cmy_str,summary=None,tags=None)
                                    # redis_cli.rpush("automatic_news", json.dumps(tmp_dict))

                                except Exception as e:
                                    log.error("[%s] %s", "写入redis", str(e))
                                    raise e
                        except Exception as e:
                            log.error("[%s] %s", "循环资讯列表", str(e))
                            raise e

                        # -*- 获取page标签元素
                        try:
                            from time import sleep

                            sleep(0)
                            rpa_eb862f_webpage.add_element("rpa_d59abf", id="", css="",
                                                           xpath=["//div[@class='pagebox']/a[@title='下一页']"], frame=[])
                            rpa_eb862f_webpage.switch_to_frame_by_path([])
                            rpa_9bca3a = rpa_eb862f_webpage.get_element(element_name="rpa_d59abf", index=0, timeout=30)
                            sleep(0)

                        except Exception as e:
                            log.error("[%s] %s", "获取page标签元素", str(e))
                            raise e

                        # -*- 判断下一页存在
                        try:
                            if rpa_9bca3a is None:
                                break

                        except Exception as e:
                            log.error("[%s] %s", "判断下一页存在", str(e))
                            raise e

                        # -*- 点击下一页
                        try:
                            from time import sleep

                            sleep(0)
                            rpa_eb862f_webpage.switch_to_frame_by_path(rpa_9bca3a.frame)
                            from rpa import ElementClickMethod

                            rpa_9bca3a.click(method=ElementClickMethod.MOUSE_CLICK)
                            sleep(0)

                        except Exception as e:
                            log.error("[%s] %s", "点击下一页", str(e))
                            raise e
                    except Exception as e:

                        # -*- 记录错误日志
                        try:
                            # import logging
                            # LOG_FORMAT = "%(asctime)s - %(levelname)s - %(message)s"
                            # DATE_FORMAT = "%Y-%m-%d %H:%M:%S"
                            # logging.basicConfig(filename='my.log', level=logging.ERROR, format=LOG_FORMAT,datefmt=DATE_FORMAT)
                            # logging.error(cmy_str)
                            print(cmy_str)

                        except Exception as e:
                            log.error("[%s] %s", "记录错误日志", str(e))
                            raise e

                        # -*- 退出循环1
                        try:
                            continue

                        except Exception as e:
                            log.error("[%s] %s", "退出循环1", str(e))
                            raise e
                    finally:
                        pass

                except Exception as e:
                    log.error("[%s] %s", "异常处理1", str(e))
                    raise e
        except Exception as e:
            log.error("[%s] %s", "循环执行2", str(e))
            raise e
except Exception as e:
    visual_block.Visual_Block_Info("循环执行", 7, 2, e)

    log.error("[%s] %s", "循环执行", str(e))
    raise e

# -*- 流程结束
try:

    visual_block.Visual_Block_LastLine()

except Exception as e:
    log.error("[%s] %s", "流程结束", str(e))
